# Ejercicio 2 Víctor Manuel Tenorio Gómez

### Esquema

![Esquema base de datos](Esquemas_bbdd_isi_2.jpg "Esquema base de datos")

In [31]:
%load_ext sql
%sql sqlite:///e2.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: None@e2.db'

In [51]:
%%sql
DROP TABLE IF EXISTS Profesor;
DROP TABLE IF EXISTS Proyecto;
DROP TABLE IF EXISTS Investiga;
DROP TABLE IF EXISTS Estudiante;
DROP TABLE IF EXISTS Trabaja;
DROP TABLE IF EXISTS Departamento;
DROP TABLE IF EXISTS Trabajan_en_Dep;

Done.
Done.
Done.
Done.
Done.
Done.
Done.

[]

In [52]:
%%sql
DROP TABLE IF EXISTS Profesor;
CREATE TABLE Profesor (nif VARCHAR(9),
                       nombre VARCHAR(20),
                       edad INT,
                       cargo VARCHAR(20),
                       especialidad VARCHAR(20),
                       PRIMARY KEY(nif));

Done.
Done.

[]

In [53]:
%%sql
DROP TABLE IF EXISTS Proyecto;
CREATE TABLE Proyecto (numero INT,
                       nombre_finan VARCHAR(20),
                       fecha_inicio DATE,
                       fecha_fin DATE,
                       presupuesto FLOAT,
                       nif_prof_gestiona VARCHAR(9) NOT NULL,
                       PRIMARY KEY(numero),
                       FOREIGN KEY(nif_prof_gestiona) REFERENCES Profesor(nif));

Done.
Done.

[]

In [54]:
%%sql
DROP TABLE IF EXISTS Investiga;
CREATE TABLE Investiga (nif_prof VARCHAR(9),
                        num_proyecto INT,
                        PRIMARY KEY(nif_prof, num_proyecto),
                        FOREIGN KEY(nif_prof) REFERENCES Profesor(nif),
                        FOREIGN KEY(num_proyecto) REFERENCES Proyecto(numero));

Done.
Done.

[]

In [55]:
%%sql
DROP TABLE IF EXISTS Estudiante;
CREATE TABLE Estudiante (nif VARCHAR(9),
                         nombre VARCHAR(20),
                         edad INT,
                         titulacion VARCHAR(20),
                         dep_asociado INT NOT NULL,
                         nif_estudiante_tutor VARCHAR(9) NOT NULL,
                         PRIMARY KEY(nif),
                         FOREIGN KEY (dep_asociado) REFERENCES Departamento(numero),
                         FOREIGN KEY (nif_estudiante_tutor) REFERENCES Estudiante(nif));

Done.
Done.

[]

In [56]:
%%sql
DROP TABLE IF EXISTS Trabaja;
CREATE TABLE Trabaja(nif_profesor_superv VARCHAR(9),
                     nif_alumno VARCHAR(9),
                     num_proyecto VARCHAR(9),
                     PRIMARY KEY(nif_profesor_superv, nif_alumno, num_proyecto),
                     FOREIGN KEY (nif_profesor_superv) REFERENCES Profesor(nif),
                     FOREIGN KEY (nif_alumno) REFERENCES Alumno(nif),
                     FOREIGN KEY (num_proyecto) REFERENCES Proyecto(numero));

Done.
Done.

[]

In [57]:
%%sql
DROP TABLE IF EXISTS Departamento;
CREATE TABLE Departamento(numero INT,
                          nombre VARCHAR(20),
                          edificio VARCHAR(20),
                          nif_director VARCHAR(9) NOT NULL,
                          PRIMARY KEY(numero),
                          FOREIGN KEY(nif_director) REFERENCES Profesor(nif));

Done.
Done.

[]

In [58]:
%%sql
DROP TABLE IF EXISTS Trabajan_en_Dep;
CREATE TABLE Trabajan_en_Dep(nif_prof VARCHAR(9),
                             num_departamento INT,
                             perct_tiempo FLOAT,
                             PRIMARY KEY(nif_prof, num_departamento),
                             FOREIGN KEY(nif_prof) REFERENCES Profesor(nif),
                             FOREIGN KEY(num_departamento) REFERENCES Departamento(numero));

Done.
Done.

[]

## Inserciones a la base de datos

In [59]:
%sql PRAGMA foreign_keys = ON;

Done.

[]

In [60]:
%%sql
INSERT INTO Profesor(nif, nombre, edad, cargo, especialidad) VALUES ('12345678N', 'Pedro', 30, 'Presidente', 'Programacion');
INSERT INTO Profesor(nif, nombre, edad, cargo, especialidad) VALUES ('23456789T', 'Jose', 40, 'Asociado', 'Programacion');
INSERT INTO Profesor(nif, nombre, edad, cargo, especialidad) VALUES ('11111111S', 'Antonio', 25, 'Presidente', 'Senal');
INSERT INTO Profesor(nif, nombre, edad, cargo, especialidad) VALUES ('22222222R', 'Eva', 30, 'Asociada', 'Programacion');

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [61]:
%%sql
INSERT INTO Proyecto(numero, nombre_finan, fecha_inicio, fecha_fin, presupuesto, nif_prof_gestiona)
VALUES (123456, 'TSC', date('2015-12-17'), date('2017-12-17'), 50000, '11111111S');
INSERT INTO Proyecto(numero, nombre_finan, fecha_inicio, fecha_fin, presupuesto, nif_prof_gestiona)
VALUES (234567, 'GSYC', date('2015-06-11'), date('2017-06-11'), 100000, '12345678N');

1 rows affected.
1 rows affected.

[]

In [62]:
%%sql
INSERT INTO Investiga(nif_prof, num_proyecto) VALUES ('11111111S', 123456);
INSERT INTO Investiga(nif_prof, num_proyecto) VALUES ('12345678N', 234567);
INSERT INTO Investiga(nif_prof, num_proyecto) VALUES ('23456789T', 234567);
INSERT INTO Investiga(nif_prof, num_proyecto) VALUES ('22222222R', 234567);

1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [63]:
%%sql
SELECT *
FROM Profesor

Done.

[('12345678N', 'Pedro', 30, 'Presidente', 'Programacion'),
 ('23456789T', 'Jose', 40, 'Asociado', 'Programacion'),
 ('11111111S', 'Antonio', 25, 'Presidente', 'Senal'),
 ('22222222R', 'Eva', 30, 'Asociada', 'Programacion')]

In [64]:
%%sql
SELECT *
FROM Proyecto

Done.

[(123456, 'TSC', '2015-12-17', '2017-12-17', 50000.0, '11111111S'),
 (234567, 'GSYC', '2015-06-11', '2017-06-11', 100000.0, '12345678N')]

In [65]:
%%sql
SELECT *
FROM Investiga

Done.

[('11111111S', 123456),
 ('12345678N', 234567),
 ('23456789T', 234567),
 ('22222222R', 234567)]

In [66]:
%%sql
SELECT
Profesor.nombre AS 'Director',
Proyecto.numero AS 'Proyecto'
FROM Proyecto
INNER JOIN Profesor
ON Proyecto.nif_prof_gestiona = Profesor.nif;

Done.

[('Antonio', 123456), ('Pedro', 234567)]

In [67]:
%%sql
SELECT *
FROM Investiga
WHERE num_proyecto = 234567;

Done.

[('12345678N', 234567), ('23456789T', 234567), ('22222222R', 234567)]

Profesores que no gestionan ningun proyecto

In [68]:
%%sql
SELECT *
FROM Profesor
LEFT JOIN Proyecto
ON Profesor.nif = Proyecto.nif_prof_gestiona
WHERE Proyecto.numero IS NULL;

Done.

[('23456789T', 'Jose', 40, 'Asociado', 'Programacion', None, None, None, None, None, None),
 ('22222222R', 'Eva', 30, 'Asociada', 'Programacion', None, None, None, None, None, None)]

Profesores con 30 años o menos

In [69]:
%%sql
SELECT *
FROM Profesor
WHERE edad <= 30;

Done.

[('12345678N', 'Pedro', 30, 'Presidente', 'Programacion'),
 ('11111111S', 'Antonio', 25, 'Presidente', 'Senal'),
 ('22222222R', 'Eva', 30, 'Asociada', 'Programacion')]

Media de edad de los profesores de cada proyecto

In [70]:
%%sql
SELECT
Investiga.num_proyecto AS 'Proyecto',
AVG(Profesor.edad) AS 'Media Edad'
FROM Investiga
JOIN Profesor
WHERE Investiga.nif_prof = Profesor.nif
GROUP BY Investiga.num_proyecto;

Done.

[(123456, 25.0), (234567, 33.333333333333336)]

Nombre de profesores junto a entidad financiadora de los proyectos en los que trabajan

In [23]:
%%sql
SELECT
Profesor.nombre AS 'Nombre Profesor',
Proyecto.numero AS 'Proyecto',
Proyecto.nombre_finan AS 'Entidad financiadora del proyecto'
FROM Profesor
JOIN Investiga
ON Profesor.nif = Investiga.nif_prof
JOIN Proyecto
ON Proyecto.numero = Investiga.num_proyecto

Done.

[('Antonio', 123456, 'TSC'),
 ('Pedro', 234567, 'GSYC'),
 ('Jose', 234567, 'GSYC'),
 ('Eva', 234567, 'GSYC')]